SlepyCat123/STM32-LoRa--/User_Driver/src/stm32f103x_pulseCapture.c
}

// 失能测时通道
ErrorStatus PulseCapture_Disable(PulseCapture_Typedef *pCx)
{
	if(pCx== NULL)
	 {
		 return ERROR;
	 }
	 pCx->Memory.enable = DISABLE;
	 return SUCCESS;
}
//// 读取最近一次完整测量得到的时间值
//ErrorStatus PulseCapture_Read(PulseCapture_Typedef *pCx, PulseCapture_Result *result);

//void PulseCapturel_IRQHandler(void)
//{
//	static uint16_t            StartTime1=0;
//	static uint16_t            EndTime1=0;
//	static uint16_t            EdgeNum1=0;
//	uint32_t                    PulseCaptureDatel=0;
//	
//	TIM_TimeBaseInit(TIM_TypeDef* TIMx, TIM_TimeBaseInitTypeDef* TIM_TimeBaseInitStruct);
//	 TIM_Cmd(TIM_TypeDef* TIMx, FunctionalState NewState);
//	
//	if (EXTI_GetITStatus(Pulse_CAPTURE1.Hardware.EXTI_Line) != RESET)
//	{
//	 EdgeNum1=Fresh;
//   StartTime1=TIM_GetCounter(Pulse_CAPTURE1_TIMx );
//			while(EXTI_GetITStatus(Pulse_CAPTURE1.Hardware.EXTI_Line) != RESET)
//			{

//			}
//			EndTime1=TIM_GetCounter(Pulse_CAPTURE1_TIMx );
//			EdgeNum1=NoFresh;
//			PulseCaptureDatel=EndTime1-StartTime1;
//	}
//	
//}


 //中断服务程序1函数
 void Pulse_CAPTURE1_IRQHandler(void)
 {
	 static uint16_t Start_High_Time = 0,Start_Low_Time = 0;
	 static uint16_t Finsh_High_Time = 0,Finsh_Low_Time = 0;
	 
	 if(EXTI_GetITStatus(Pulse_CAPTURE1->Hardware.EXTI_LINEx) == SET && Pulse_CAPTURE1->Memory.enable == ENABLE)
	 {
		 EXTI_ClearITPendingBit(Pulse_CAPTURE1->Hardware.EXTI_LINEx);
		 switch(Pulse_CAPTURE1->Memory.mode)
		 {
			 case PulseCapture_Mode_High:
				 switch(Pulse_CAPTURE1->Memory.polarity)
				 {
					 case  PulseCapture_Polarity_Positive:
						 if(Flag1 == 0)
						 {
							 if(1 == GPIO_ReadInputDataBit(Pulse_CAPTURE1->Hardware.GPIOx,Pulse_CAPTURE1->Hardware.Pinx))
							 {
								 Start_High_Time = TIM_GetCounter(Pulse_CAPTURE1->Hardware.TIMx);
								 Flag1 += 1;
							 }
						 }
						 else if(Flag1 == 1)
						 {
							 if(0 == GPIO_ReadInputDataBit(Pulse_CAPTURE1->Hardware.GPIOx,Pulse_CAPTURE1->Hardware.Pinx))
							 {
							 Finsh_High_Time = TIM_GetCounter(Pulse_CAPTURE1->Hardware.TIMx);
							 Flag1 = 0;
							 Pulse1_Data.Fresh = SET;
							 if(Start_High_Time > Finsh_High_Time)
							 {
								 Pulse1_Data.HighlevelTime = 65535 + Finsh_High_Time - Start_High_Time;
							 }
							 else if(Finsh_High_Time > Start_High_Time)
							 {
								 Pulse1_Data.HighlevelTime = Finsh_High_Time - Start_High_Time;
							 }
						 }
						 }
						 break;
					 case PulseCapture_Polarity_Negative:
						 if(Flag1 == 0)
						 {
							 if(0 == GPIO_ReadInputDataBit(Pulse_CAPTURE1->Hardware.GPIOx,Pulse_CAPTURE1->Hardware.Pinx))
							 {
								 Start_High_Time = TIM_GetCounter(Pulse_CAPTURE1->Hardware.TIMx);
								 Flag1 += 1;
							 }
						 }
						 else if(Flag1 == 1)
						 {
							 if(1 == GPIO_ReadInputDataBit(Pulse_CAPTURE1->Hardware.GPIOx,Pulse_CAPTURE1->Hardware.Pinx))
							 {
							 Finsh_High_Time = TIM_GetCounter(Pulse_CAPTURE1->Hardware.TIMx);
							 Flag1 = 0;
							 Pulse1_Data.Fresh = SET;
							 if(Start_High_Time > Finsh_High_Time)
							 {
								 Pulse1_Data.HighlevelTime = 65535 + Finsh_High_Time - Start_High_Time;
							 }
							 else if(Finsh_High_Time > Start_High_Time)
							 {
								 Pulse1_Data.HighlevelTime = Finsh_High_Time - Start_High_Time;
							 }
						 }
						 }
						 break;					
				 }
			 case   PulseCapture_Mode_Low:
				 switch(Pulse_CAPTURE1->Memory.mode)
				 {
					 case PulseCapture_Mode_High:
						 if(Flag1 == 0)
						 {
							 if(0 == GPIO_ReadInputDataBit(Pulse_CAPTURE1->Hardware.GPIOx,Pulse_CAPTURE1->Hardware.Pinx))
							 {
								 Start_Low_Time = TIM_GetCounter(Pulse_CAPTURE1->Hardware.TIMx);
								 Flag1 += 1;
							 }
						 }
						 else if(Flag1 == 1)
						 {
  						 if(1 == GPIO_ReadInputDataBit(Pulse_CAPTURE1->Hardware.GPIOx,Pulse_CAPTURE1->Hardware.Pinx))
							 {
							 Finsh_Low_Time = TIM_GetCounter(Pulse_CAPTURE1->Hardware.TIMx);
							 Flag1 = 0;
							 Pulse1_Data.Fresh = SET;
							 if(Start_Low_Time > Finsh_Low_Time)
							 {
								 Pulse1_Data.LowlevelTime = 65535 + Finsh_Low_Time - Start_Low_Time;
							 }
							 else if(Finsh_Low_Time > Start_Low_Time)
							 {
								 Pulse1_Data.LowlevelTime = Finsh_Low_Time - Start_Low_Time;
							 }
						 }
						 }
						 break;
					 case PulseCapture_Polarity_Negative:
						 if(Flag1 == 0)
						 {
							 if(1 == GPIO_ReadInputDataBit(Pulse_CAPTURE1->Hardware.GPIOx,Pulse_CAPTURE1->Hardware.Pinx))
							 {
								 Start_Low_Time = TIM_GetCounter(Pulse_CAPTURE1->Hardware.TIMx);
								 Flag1 += 1;
							 }
						 }
						 else if(Flag1 == 1)
						 {
							 if(0 == GPIO_ReadInputDataBit(Pulse_CAPTURE1->Hardware.GPIOx,Pulse_CAPTURE1->Hardware.Pinx))
							 {							 
							 Finsh_Low_Time = TIM_GetCounter(Pulse_CAPTURE1->Hardware.TIMx);
							 Flag1 = 0;
							 Pulse1_Data.Fresh = SET;
							 if(Start_Low_Time > Finsh_Low_Time)
							 {
								 Pulse1_Data.LowlevelTime = 65535 + Finsh_Low_Time - Start_Low_Time;
							 }
							 else if(Finsh_Low_Time > Start_Low_Time)
							 {
								 Pulse1_Data.LowlevelTime = Finsh_Low_Time - Start_Low_Time;
							 }
							 }
						 }
					default:break;				
				 }
			 case     PulseCapture_Mode_Period :
				 switch(Pulse_CAPTURE1->Memory.mode)
				 {
					 case PulseCapture_Mode_High:
						 if(Flag1 == 0)
						 {
							 if(1 == GPIO_ReadInputDataBit(Pulse_CAPTURE1->Hardware.GPIOx,Pulse_CAPTURE1->Hardware.Pinx))
							 {
								 Start_High_Time = TIM_GetCounter(Pulse_CAPTURE1->Hardware.TIMx);
								 Flag1 += 1;
							 }
						 }
						 else if(Flag1 == 1)
						 {
							 if(0 == GPIO_ReadInputDataBit(Pulse_CAPTURE1->Hardware.GPIOx,Pulse_CAPTURE1->Hardware.Pinx))
							 {
							 Finsh_High_Time = TIM_GetCounter(Pulse_CAPTURE1->Hardware.TIMx);
							 Start_Low_Time  = TIM_GetCounter(Pulse_CAPTURE1->Hardware.TIMx);
							 Flag1 += 1;
							 }
 						 }
						 else if(Flag1 == 2)
						 {
							 if(1 == GPIO_ReadInputDataBit(Pulse_CAPTURE1->Hardware.GPIOx,Pulse_CAPTURE1->Hardware.Pinx))
							 {
							 Finsh_Low_Time = TIM_GetCounter(Pulse_CAPTURE1->Hardware.TIMx);
							 Flag1 = 0;
							 Pulse1_Data.Fresh = SET;
							 if(Start_High_Time > Finsh_High_Time)
							 {
								 Pulse1_Data.HighlevelTime = 65535 + Finsh_High_Time - Start_High_Time;
							 }
							 else if(Finsh_High_Time > Start_High_Time)
							 {
								 Pulse1_Data.HighlevelTime = Finsh_High_Time - Start_High_Time;
							 }
							 if(Start_Low_Time > Finsh_Low_Time)
							 {
								 Pulse1_Data.LowlevelTime = 65535 + Finsh_Low_Time - Start_Low_Time;
							 }
							 else if(Finsh_Low_Time > Start_Low_Time)
							 {
								 Pulse1_Data.LowlevelTime = Finsh_Low_Time - Start_Low_Time;
							 }
							 Pulse1_Data.CycleTime     = Pulse1_Data.HighlevelTime + Pulse1_Data.LowlevelTime;            
						 }
					 }
						 break;
					 case PulseCapture_Polarity_Negative:
						 if(Flag1 == 0)
						 {
							 if(0 == GPIO_ReadInputDataBit(Pulse_CAPTURE1->Hardware.GPIOx,Pulse_CAPTURE1->Hardware.Pinx))
							 {
								 Start_High_Time = TIM_GetCounter(Pulse_CAPTURE1->Hardware.TIMx);
								 Flag1 += 1;
							 }
						 }
						 else if(Flag1 == 1)
						 {
							 if(1 == GPIO_ReadInputDataBit(Pulse_CAPTURE1->Hardware.GPIOx,Pulse_CAPTURE1->Hardware.Pinx))
							 {
							 Finsh_High_Time = TIM_GetCounter(Pulse_CAPTURE1->Hardware.TIMx);
							 Start_Low_Time  = TIM_GetCounter(Pulse_CAPTURE1->Hardware.TIMx);
							 Flag1 += 1;
 						 }
					 }
						 else if(Flag1 == 2)
						 {
							 if(0 == GPIO_ReadInputDataBit(Pulse_CAPTURE1->Hardware.GPIOx,Pulse_CAPTURE1->Hardware.Pinx))
							 {
							 Finsh_Low_Time = TIM_GetCounter(Pulse_CAPTURE1->Hardware.TIMx);
							 Flag1 = 0;
							 Pulse1_Data.Fresh = SET;
								 
							 if(Start_High_Time > Finsh_High_Time)
							 {
								 Pulse1_Data.HighlevelTime = 65535 + Finsh_High_Time - Start_High_Time;
							 }
							 else if(Finsh_High_Time > Start_High_Time)
							 {
								 Pulse1_Data.HighlevelTime = Finsh_High_Time - Start_High_Time;
							 }
							 if(Start_Low_Time > Finsh_Low_Time)
							 {
								 Pulse1_Data.LowlevelTime = 65535 + Finsh_Low_Time - Start_Low_Time;
							 }
							 else if(Finsh_Low_Time > Start_Low_Time)
							 {
								 Pulse1_Data.LowlevelTime = Finsh_Low_Time - Start_Low_Time;
							 }
							 Pulse1_Data.CycleTime     = Pulse1_Data.HighlevelTime + Pulse1_Data.LowlevelTime;            
						 }
					 }
					default:break;			
				 }				  
		 }
	 }
 }
//*************************************************************************************************

