SlepyCat123/STM32-LoRa--/User_Driver/src/stm32f103x_pulseCapture.c
 //中断服务程序1函数
 void Pulse_CAPTURE2_IRQHandler(void)
 {
	 static uint16_t Start_High_Time = 0,Start_Low_Time = 0;
	 static uint16_t Finsh_High_Time = 0,Finsh_Low_Time = 0;
	 
	 if(EXTI_GetITStatus(Pulse_CAPTURE2->Hardware.EXTI_LINEx) == SET && Pulse_CAPTURE2->Memory.enable == ENABLE)
	 {
		 EXTI_ClearITPendingBit(Pulse_CAPTURE2->Hardware.EXTI_LINEx);
		 switch(Pulse_CAPTURE2->Memory.mode)
		 {
			 case PulseCapture_Mode_High:
				 switch(Pulse_CAPTURE2->Memory.polarity)
				 {
					 case  PulseCapture_Polarity_Positive:
						 if(Flag2 == 0)
						 {
							 if(1 == GPIO_ReadInputDataBit(Pulse_CAPTURE2->Hardware.GPIOx,Pulse_CAPTURE2->Hardware.Pinx))
							 {
								 Start_High_Time = TIM_GetCounter(Pulse_CAPTURE2->Hardware.TIMx);
								 Flag2 += 1;
							 }
						 }
						 else if(Flag2 == 1)
						 {
							 if(0 == GPIO_ReadInputDataBit(Pulse_CAPTURE2->Hardware.GPIOx,Pulse_CAPTURE2->Hardware.Pinx))
							 {
							 Finsh_High_Time = TIM_GetCounter(Pulse_CAPTURE2->Hardware.TIMx);
							 Flag2 = 0;
							 Pulse2_Data.Fresh = SET;
							 if(Start_High_Time > Finsh_High_Time)
							 {
								 Pulse2_Data.HighlevelTime = 65535 + Finsh_High_Time - Start_High_Time;
							 }
							 else if(Finsh_High_Time > Start_High_Time)
							 {
								 Pulse2_Data.HighlevelTime = Finsh_High_Time - Start_High_Time;
							 }
						 }
						 }
						 break;
					 case PulseCapture_Polarity_Negative:
						 if(Flag2 == 0)
						 {
							 if(0 == GPIO_ReadInputDataBit(Pulse_CAPTURE2->Hardware.GPIOx,Pulse_CAPTURE2->Hardware.Pinx))
							 {
								 Start_High_Time = TIM_GetCounter(Pulse_CAPTURE2->Hardware.TIMx);
								 Flag2 += 1;
							 }
						 }
						 else if(Flag2 == 1)
						 {
							 if(1 == GPIO_ReadInputDataBit(Pulse_CAPTURE2->Hardware.GPIOx,Pulse_CAPTURE2->Hardware.Pinx))
							 {
							 Finsh_High_Time = TIM_GetCounter(Pulse_CAPTURE2->Hardware.TIMx);
							 Flag2 = 0;
							 Pulse2_Data.Fresh = SET;
							 if(Start_High_Time > Finsh_High_Time)
							 {
								 Pulse2_Data.HighlevelTime = 65535 + Finsh_High_Time - Start_High_Time;
							 }
							 else if(Finsh_High_Time > Start_High_Time)
							 {
								 Pulse2_Data.HighlevelTime = Finsh_High_Time - Start_High_Time;
							 }
						 }
						 }
						 break;					
				 }
			 case   PulseCapture_Mode_Low:
				 switch(Pulse_CAPTURE2->Memory.mode)
				 {
					 case PulseCapture_Mode_High:
						 if(Flag2 == 0)
						 {
							 if(0 == GPIO_ReadInputDataBit(Pulse_CAPTURE2->Hardware.GPIOx,Pulse_CAPTURE2->Hardware.Pinx))
							 {
								 Start_Low_Time = TIM_GetCounter(Pulse_CAPTURE2->Hardware.TIMx);
								 Flag2 += 1;
							 }
						 }
						 else if(Flag2 == 1)
						 {
  						 if(1 == GPIO_ReadInputDataBit(Pulse_CAPTURE2->Hardware.GPIOx,Pulse_CAPTURE2->Hardware.Pinx))
							 {
							 Finsh_Low_Time = TIM_GetCounter(Pulse_CAPTURE2->Hardware.TIMx);
							 Flag2 = 0;
							 Pulse2_Data.Fresh = SET;
							 if(Start_Low_Time > Finsh_Low_Time)
							 {
								 Pulse2_Data.LowlevelTime = 65535 + Finsh_Low_Time - Start_Low_Time;
							 }
							 else if(Finsh_Low_Time > Start_Low_Time)
							 {
								 Pulse2_Data.LowlevelTime = Finsh_Low_Time - Start_Low_Time;
							 }
						 }
						 }
						 break;
					 case PulseCapture_Polarity_Negative:
						 if(Flag2 == 0)
						 {
							 if(1 == GPIO_ReadInputDataBit(Pulse_CAPTURE2->Hardware.GPIOx,Pulse_CAPTURE2->Hardware.Pinx))
							 {
								 Start_Low_Time = TIM_GetCounter(Pulse_CAPTURE2->Hardware.TIMx);
								 Flag2 += 1;
							 }
						 }
						 else if(Flag2 == 1)
						 {
							 if(0 == GPIO_ReadInputDataBit(Pulse_CAPTURE2->Hardware.GPIOx,Pulse_CAPTURE2->Hardware.Pinx))
							 {							 
							 Finsh_Low_Time = TIM_GetCounter(Pulse_CAPTURE2->Hardware.TIMx);
							 Flag2 = 0;
							 Pulse2_Data.Fresh = SET;
							 if(Start_Low_Time > Finsh_Low_Time)
							 {
								 Pulse2_Data.LowlevelTime = 65535 + Finsh_Low_Time - Start_Low_Time;
							 }
							 else if(Finsh_Low_Time > Start_Low_Time)
							 {
								 Pulse2_Data.LowlevelTime = Finsh_Low_Time - Start_Low_Time;
							 }
							 }
						 }
					default:break;				
				 }
			 case     PulseCapture_Mode_Period :
				 switch(Pulse_CAPTURE2->Memory.mode)
				 {
					 case PulseCapture_Mode_High:
						 if(Flag2 == 0)
						 {
							 if(1 == GPIO_ReadInputDataBit(Pulse_CAPTURE2->Hardware.GPIOx,Pulse_CAPTURE2->Hardware.Pinx))
							 {
								 Start_High_Time = TIM_GetCounter(Pulse_CAPTURE2->Hardware.TIMx);
								 Flag2 += 1;
							 }
						 }
						 else if(Flag2 == 1)
						 {
							 if(0 == GPIO_ReadInputDataBit(Pulse_CAPTURE2->Hardware.GPIOx,Pulse_CAPTURE2->Hardware.Pinx))
							 {
							 Finsh_High_Time = TIM_GetCounter(Pulse_CAPTURE2->Hardware.TIMx);
							 Start_Low_Time  = TIM_GetCounter(Pulse_CAPTURE2->Hardware.TIMx);
							 Flag2 += 1;
							 }
 						 }
						 else if(Flag2 == 2)
						 {
							 if(1 == GPIO_ReadInputDataBit(Pulse_CAPTURE2->Hardware.GPIOx,Pulse_CAPTURE2->Hardware.Pinx))
							 {
							 Finsh_Low_Time = TIM_GetCounter(Pulse_CAPTURE2->Hardware.TIMx);
							 Flag2 = 0;
							 Pulse2_Data.Fresh = SET;
							 if(Start_High_Time > Finsh_High_Time)
							 {
								 Pulse2_Data.HighlevelTime = 65535 + Finsh_High_Time - Start_High_Time;
							 }
							 else if(Finsh_High_Time > Start_High_Time)
							 {
								 Pulse2_Data.HighlevelTime = Finsh_High_Time - Start_High_Time;
							 }
							 if(Start_Low_Time > Finsh_Low_Time)
							 {
								 Pulse2_Data.LowlevelTime = 65535 + Finsh_Low_Time - Start_Low_Time;
							 }
							 else if(Finsh_Low_Time > Start_Low_Time)
							 {
								 Pulse2_Data.LowlevelTime = Finsh_Low_Time - Start_Low_Time;
							 }
							 Pulse2_Data.CycleTime     = Pulse2_Data.HighlevelTime + Pulse2_Data.LowlevelTime;            
						 }
					 }
						 break;
					 case PulseCapture_Polarity_Negative:
						 if(Flag2 == 0)
						 {
							 if(0 == GPIO_ReadInputDataBit(Pulse_CAPTURE2->Hardware.GPIOx,Pulse_CAPTURE2->Hardware.Pinx))
							 {
								 Start_High_Time = TIM_GetCounter(Pulse_CAPTURE2->Hardware.TIMx);
								 Flag2 += 1;
							 }
						 }
						 else if(Flag2 == 1)
						 {
							 if(1 == GPIO_ReadInputDataBit(Pulse_CAPTURE2->Hardware.GPIOx,Pulse_CAPTURE2->Hardware.Pinx))
							 {
							 Finsh_High_Time = TIM_GetCounter(Pulse_CAPTURE2->Hardware.TIMx);
							 Start_Low_Time  = TIM_GetCounter(Pulse_CAPTURE2->Hardware.TIMx);
							 Flag2 += 1;
 						 }
					 }
						 else if(Flag2 == 2)
						 {
							 if(0 == GPIO_ReadInputDataBit(Pulse_CAPTURE2->Hardware.GPIOx,Pulse_CAPTURE2->Hardware.Pinx))
							 {
							 Finsh_Low_Time = TIM_GetCounter(Pulse_CAPTURE2->Hardware.TIMx);
							 Flag2 = 0;
							 Pulse2_Data.Fresh = SET;
								 
							 if(Start_High_Time > Finsh_High_Time)
							 {
								 Pulse2_Data.HighlevelTime = 65535 + Finsh_High_Time - Start_High_Time;
							 }
							 else if(Finsh_High_Time > Start_High_Time)
							 {
								 Pulse2_Data.HighlevelTime = Finsh_High_Time - Start_High_Time;
							 }
							 if(Start_Low_Time > Finsh_Low_Time)
							 {
								 Pulse2_Data.LowlevelTime = 65535 + Finsh_Low_Time - Start_Low_Time;
							 }
							 else if(Finsh_Low_Time > Start_Low_Time)
							 {
								 Pulse2_Data.LowlevelTime = Finsh_Low_Time - Start_Low_Time;
							 }
							 Pulse2_Data.CycleTime     = Pulse2_Data.HighlevelTime + Pulse2_Data.LowlevelTime;            
						 }
					 }
					default:break;			
				 }				  
		 }
	 }
 }
//*************************************************************************************************
 
 ErrorStatus PulseCapture_PrecisionSelect(PulseCapture_Typedef *pCx, PulseCapture_Precision PRE)
 {
	 	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
	  TIM_OCInitTypeDef  TIM_OCInitStructure;
	 switch(PRE)
	 {
		 case PulseCapture_Precision_0_014:
			 {   
				 TIM_TimeBaseStructure.TIM_Period = 1; 
			 }
		 case PulseCapture_Precision_0_125:
		 {
				 TIM_TimeBaseStructure.TIM_Period = 9; 			 
		 }
		 case PulseCapture_Precision_0_5:
		 {
				 TIM_TimeBaseStructure.TIM_Period = 36; 			 
		 }
     case PulseCapture_Precision_1_0:
		 {
				 TIM_TimeBaseStructure.TIM_Period = 72; 			 
		 }
		 case PulseCapture_Precision_10:
		 {
				 TIM_TimeBaseStructure.TIM_Period = 720; 			 
		 }
    default:break;
	 }
//   TIM_TimeBaseStructure.TIM_Period = 999;       //当定时器从0计数到999，即为1000次，为一个定时周期
   TIM_TimeBaseStructure.TIM_Prescaler = 0;	    //设置预分频：不预分频，即为72MHz
   TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1 ;	//设置时钟分频系数：不分频
   TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  //向上计数模式

   TIM_TimeBaseInit(pCx->Hardware.TIMx, &TIM_TimeBaseStructure);
 
 }
 